# lesson2.4

# Задание 2.2
# Создайте программу «Англо-французский словарь». Нужно хранить слово на 
# английском языке и его перевод на французский. Требуется реализовать 
# возможность добавления, удаления, поиска, замены данных. Используйте 
# словарь для хранения информации.

main_dict = {
    'One': 'Un(Une)',
    'Two': 'Deux',
    'Three': 'Trois',
    'Four': 'quatre',  
    'Five': 'cinq',
    }

print('---------------------------------------------------------------------')
print('Англо-французский словарь. V.1.0.0')
print('---------------------------------------------------------------------')
for key, value in main_dict.items():
    print(key, ' - ', value, sep='')
print('---------------------------------------------------------------------')

a=5
while a>1:

    print('Возможные действия:\n1) добавить новые слова; 2) удалить слова;' 
        ' 3) заменить слова; 4) найти слова; 5) выйти')
    print('---------------------------------------------------------------------')

    main_choice = int(input('Введите номер нужного действия: '))
    print('---------------------------------------------------------------------')

    if main_choice == 1:
        en_1 = input('Введите английское слово: ')
        fr_1 = input('Введите перевод на французский: ')
        print('---------------------------------------'
        '------------------------------')
        print(en_1, ' - ', fr_1)
        choice_1=input('Вы уверенны? (y/n): ')
        print('---------------------------------------'
        '------------------------------')
        if choice_1 == 'y':
            main_dict[en_1]=fr_1
            for key, value in main_dict.items():
                print(key, ' - ', value, sep='')
        else: 
            exit

    elif main_choice == 2:
        remove = input('Введите пару, которую необходимо удалить (англ.): ')
        print('---------------------------------------'
        '------------------------------')
        print(remove, ' - ', main_dict[remove])
        choice_2=input('Вы уверенны? (y/n): ')
        print('---------------------------------------'
        '------------------------------')
        if choice_2 == 'y':
            del main_dict[remove]
            for key, value in main_dict.items():
                print(key, ' - ', value, sep='')
        else: 
            exit

    elif main_choice == 3:
        replace = input('Введите слово на английском: ')
        print('---------------------------------------'
        '------------------------------')
        print(replace, ' - ', main_dict[replace])
        choice_3=input('Вы уверенны? (y/n): ')
        print('---------------------------------------'
        '------------------------------')
        if choice_3 == 'y':
            choice_4 = int(input('Введите что заменить: 1) английское слово;'
                            '2) перевод на французский: '))
            if choice_4 == 1:
                en_2 = input(f'Введите новое значение вместо {replace}: ')
                print('---------------------------------------'
                '------------------------------')
                print(en_2, ' - ', main_dict[replace])
                choice_5=input('Вы уверенны? (y/n): ')
                print('---------------------------------------'
                '------------------------------')
                if choice_5 == 'y':
                    main_dict[en_2]=main_dict.pop(replace)
                    for key, value in main_dict.items():
                        print(key, ' - ', value, sep='')
            if choice_4 == 2:
                fr_2 = input(f'Введите новое значение вместо {main_dict[replace]}: ')
                print('---------------------------------------'
                '------------------------------')
                print(replace, ' - ', fr_2)
                choice_6=input('Вы уверенны? (y/n): ')
                print('---------------------------------------'
                '------------------------------')
                if choice_6 == 'y':
                    main_dict[replace]=fr_2
                    for key, value in main_dict.items():
                        print(key, ' - ', value, sep='')


    elif main_choice == 4:
        search =input('Введите поисковый запрос: ')
        for key, value in main_dict.items():
            if key == search or search in value:
                print(key, ' - ', value, sep='')

    elif main_choice == 5:
        break

    else:
        print('error')

    