# Lesson2.4

# Задание 1
# Есть три кортежа целых чисел необходимо найти элементы, 
# которые есть во всех кортежах.
# Задание 2
# Есть три кортежа целых чисел необходимо найти элементы, 
# которые уникальны для каждого списка.
# Задание 3
# Есть три кортежа целых чисел необходимо найти элементы, 
# которые есть в каждом из кортежей и находятся в каждом 
# из кортежей на той же позиции.

from random import randint

list_1=[]
list_2=[]
list_3=[]

for i in range(10):       
    list_1.append(randint(1, 100))
    list_2.append(randint(1, 100))
    list_3.append(randint(1, 100))

tuple_1=tuple(list_1)
tuple_2=tuple(list_2)
tuple_3=tuple(list_3)

print('---------------------------------------------------------------------')
print ('Кортеж №1: ', tuple_1)
print ('Кортеж №2: ', tuple_2)
print ('Кортеж №3: ', tuple_3)
print('---------------------------------------------------------------------')

# Задание 1.1
for i in tuple_1:
    if i in tuple_2 and i in tuple_3:
        print ('Общие элементы в кортежах: ', i)
        print('---------------------------------------------------------------------')

# Задание 1.2

unique_1=[i for i in tuple_1 if tuple_1.count(i) == 1]
unique_2=[i for i in tuple_2 if tuple_2.count(i) == 1] 
unique_3=[i for i in tuple_3 if tuple_3.count(i) == 1]

print('Уникальные элементы в кортеже № 1: ', str(unique_1)[1:-1])
print('Уникальные элементы в кортеже № 2: ', str(unique_2)[1:-1])
print('Уникальные элементы в кортеже № 3: ', str(unique_3)[1:-1])
print('---------------------------------------------------------------------')

# Задание 1.3

for i in tuple_1:
    if i in tuple_2 and i in tuple_3:
        if tuple_1.index(i) == tuple_2.index(i) and tuple_1.index(i) == tuple_3.index(i):
            print('Элементы, которые есть в каждом из кортежей и находятся' 
            'в каждом из кортежей на той же позиции: ', i)
            print('---------------------------------------------------------------------')
        